using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace IAUEC_Apps.DTO.University.Wallet
{
    public enum TransactionTypeEnum
    {
        Deposit = 1,
        WalletPurchase = 2,
        CancelWalletPurchase = 3,
        StudentCardPurchase = 4,
        StampPurchase = 5,
        FileDownloadPurchase = 6,
        StudyingCertificate = 7,
        اعلاميه_حسابداري = 8,
        جريمه = 9,
        بدهکاري_از_قبل = 10,
        ارزشيابي_مدارک = 11,
        بيمه = 12,
        پرداخت_به_دانشجو = 13,
        بدهي_از_درس = 14,
        انتقال_بدهکار = 15,
        هزينه_چک = 16,
        مبلغ_تقسيط = 17,
        هزينه_پارکينگ = 18,
        هزينه_سرويس = 19,
        وام_دانشجوي_بدهکار = 20,
        هزينه_انصراف = 21,
        هزينه_فينال = 22,
        هزينه_فارغ_التحصيلي = 23,
        هزينه_خدمات_اداري = 24,
        وام_خوابگاه = 25,
        شهريه_معرفي_به_استاد = 26,
        انصراف_از_خوابگاه = 27,
        شهريه_ترم_جبراني = 28,
        درآمد_متفرقه = 29,
        هزينه_پيش_ترم = 30,
        هزينه_درماني = 31,
        برگشت_مصوبه_39 = 32,
        برگشت_وام = 33,
        هزينه_خدمات_آموزشي = 34,
        تعهد_سازمانها_بدهکار = 35,
        برگشت_از_تخفيف = 36,
        تسويه_بستانکاري_جزء = 37,
        هزينه_پست_کارت_دانشجويي = 38,
        هزينه_پيامک = 39,
        //جريمه = 40,
        شهريه = 41,
        اصلاحیه = 42,
        افزایش_تخفیف_شهریه_اعتبار = 43,
        استرداد_وجه = 44
    }
}
